# ICodeCheckingParameterServer Interface

---
C#Visual BasicVisual C++
Revit 2024 API
---
ICodeCheckingParameterServer Interface
Members See Also
---
Interface for the code checking parameter server to implement.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public interface ICodeCheckingParameterServer : IExternalServer
```

Visual Basic
---
```text
Public Interface ICodeCheckingParameterServer _
	Inherits IExternalServer
```

Visual C++
---
```text
public interface class ICodeCheckingParameterServer : IExternalServer
```

# See Also
ICodeCheckingParameterServer Members
Autodesk.Revit.DB.Structure Namespace